In [21]:
import pandas 
dt= pandas.read_csv('data_ex2.csv')
dt['Names']=dt['First name']+dt['Last name']
dt.drop(columns = ['First name', 'Last name'],inplace = True)
dt= dt[['Names','Identifier','Department','Location','Access code','Recovery code']]
data={}
for cols in ['Names','Department','Location','Access code','Recovery code']:
        data[cols]=dt[cols].tolist()
data_new= pandas.DataFrame(data ,index = dt['Identifier'].tolist())
data_new

             Names   Department    Location Access code Recovery code
9012  RachelBooker        Sales  Manchester      12se74        rb9012
2070     LauraGrey        Depot      London      04ap67        lg2070
4081  CraigJohnson        Depot      London      30no86        cj4081
9346   MaryJenkins  Engineering  Manchester      14ju73        mj9346
5079    JamieSmith  Engineering  Manchester      09ja61        js5079